Revit 2024 API
MEPHiddenLineSettings.DrawHiddenLine Property
 Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool DrawHiddenLine { get; set; }
Visual Basic
Public Property DrawHiddenLine As Boolean
	Get
	Set
Visual C++
public:
property bool DrawHiddenLine {
	bool get ();
	void set (bool value);
}
See Also
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace